---
kind: property
id: P:Autodesk.Revit.DB.UnitTypeId.JoulesPerGram
source: html/e3edec5d-d93d-b76d-15b0-6ba9cb921cc6.htm
---
# Autodesk.Revit.DB.UnitTypeId.JoulesPerGram Property

Joules per gram.

## Syntax (C#)
```csharp
public static ForgeTypeId JoulesPerGram { get; }
```